{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c8a26f09",
   "metadata": {},
   "source": [
    "# Cache Engine\n",
    "Purpose is to build an eninge to cache results from Neo4j and MongoDB.<br>\n",
    "By: Jonathan Lo<br>\n",
    "Date: 8/12/23"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bbc3518c",
   "metadata": {},
   "source": [
    "## Overhead"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "05b95e68",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Imports\n",
    "import redis\n",
    "from json import load\n",
    "from pymongo import MongoClient\n",
    "from py2neo import Graph\n",
    "from ast import literal_eval\n",
    "from time import time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68d9f878",
   "metadata": {},
   "source": [
    "## Engine"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "3336d372",
   "metadata": {},
   "outputs": [],
   "source": [
    "class CacheEngine():\n",
    "    \"\"\" Engine to improve query time of queries by using Redis\n",
    "        as an L1 Cache.\n",
    "    \"\"\"\n",
    "    \n",
    "    def __init__(self, secrets_path):\n",
    "        self.redis = None\n",
    "        self.neo4j = None\n",
    "        self.mongo_tweets = None\n",
    "        self.mongo_airports = None\n",
    "        \n",
    "        self._setup(secrets_path)\n",
    "        \n",
    "    def execute_neo4j(self, query):\n",
    "        \"\"\" Executes neo4j against cache\n",
    "        query: The cypher query to be executed against\n",
    "        \"\"\"\n",
    "        # If in Redis Cache hit, return\n",
    "        res = self.redis.hget(\"neo_cache\", key=query)\n",
    "        if res:\n",
    "            return res\n",
    "        \n",
    "        # Execute cypher query instead\n",
    "        db_res = self.neo4j.run(query)\n",
    "        \n",
    "        # Save query results\n",
    "        self.redis.hset(\"neo_cache\", key=query, value=str(db_res))\n",
    "        \n",
    "        return db_res\n",
    "    \n",
    "    def execute_mongo(self, target, query, projection=False):\n",
    "        \"\"\" Executes mongo against cache\n",
    "        target: Must be tweets or airports, specifies the target db::collection\n",
    "        query: The mongo query to be executed\n",
    "        projection[optional]: Projection of the result\n",
    "        \"\"\"\n",
    "        # Determine target\n",
    "        mongo_db = None\n",
    "        if target == \"tweets\":\n",
    "            mongo_db = self.mongo_tweets\n",
    "        elif target == \"airports\":\n",
    "            mongo_db = self.mongo_airports\n",
    "        else:\n",
    "            raise ValueError(\"Target must be 'tweets' or 'airports'\")\n",
    "        \n",
    "        # If in Redis Cache hit, return\n",
    "        res = self.redis.hget(\"mongo_cache\", key=str(query))\n",
    "        if res:\n",
    "            return res\n",
    "        \n",
    "        # Execute mongo query instead\n",
    "        if projection:\n",
    "            db_res = list(mongo_db.find(query, projection))\n",
    "        else:\n",
    "            db_res = list(mongo_db.find(query))\n",
    "        \n",
    "        # Save query results\n",
    "        self.redis.hset(\"mongo_cache\", key=str(query), value=str(db_res))\n",
    "        \n",
    "        return db_res\n",
    "    \n",
    "    def clear_cache(self, target=False):\n",
    "        \"\"\" Clears all Cache unless target is directly specified\n",
    "        target[optional]: Must be neo4j or mongo\n",
    "        \"\"\"\n",
    "        if not target:\n",
    "            keys = self.redis.keys('*')\n",
    "            if len(keys) == 0:\n",
    "                return True\n",
    "            self.redis.delete(*keys)\n",
    "            return True\n",
    "        \n",
    "        # Determine target\n",
    "        if target == \"neo4j\":\n",
    "            self.redis.delete(\"neo_cache\")\n",
    "        elif target == \"mongo\":\n",
    "            self.redis.delete(\"mongo_cache\")\n",
    "        else:\n",
    "            raise ValueError(\"Target must be 'neo4j' or 'mongo'\")\n",
    "        \n",
    "    \n",
    "    def _setup(self, secrets_path):\n",
    "        \"\"\" Private method to setup the engine\n",
    "        \"\"\"\n",
    "        # Obtain secrets information\n",
    "        secrets_data = load(open(secrets_path, \"r\"))\n",
    "        mongo_user = secrets_data['MongoUser']\n",
    "        mongo_pass = secrets_data['MongoPass']\n",
    "        neo4j_password = secrets_data['neo4jKey']\n",
    "        \n",
    "        # Neo4j Connection\n",
    "        neo4j_url = \"neo4j+s://65b6d554.databases.neo4j.io\"\n",
    "        neo4j_user = \"neo4j\"\n",
    "        self.neo4j = Graph(neo4j_url, auth=(neo4j_user, neo4j_password))\n",
    "\n",
    "        # MongoDB Connection\n",
    "        connection_string = f\"mongodb+srv://{mongo_user}:{mongo_pass}@dsc104-final-project.6oeuizv.mongodb.net/\"\n",
    "        client = MongoClient(connection_string)\n",
    "\n",
    "        # Obtain MongoDB Clients\n",
    "        db_tweets = client.tweets\n",
    "        db_airports = client.airports\n",
    "        self.mongo_tweets = db_tweets.tweets\n",
    "        self.mongo_airports = db_airports.prices\n",
    "\n",
    "        # Setup Redis\n",
    "        self.redis = redis.Redis(host='localhost', port=6379, db=0, charset=\"utf-8\", decode_responses=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aaf21c6c",
   "metadata": {},
   "source": [
    "## Demonstration"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "612341ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# How to initialize the engine\n",
    "engine = CacheEngine(\"./secrets.json\")\n",
    "\n",
    "# Clear engine\n",
    "engine.clear_cache()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "c087134d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Runtime: 0.614105224609375\n"
     ]
    }
   ],
   "source": [
    "# A Sample Neo4j query\n",
    "st = time()\n",
    "sample_query = \"\"\"\n",
    "MATCH (l:Hashtag)<-[:`Has_HT`]-(t:Tweet)\n",
    "WITH l, count(t) AS tweetCount\n",
    "WHERE tweetCount >= 10\n",
    "MATCH (l)<-[]-(:Tweet)-[:Has]->(s:Sentiment)\n",
    "WITH l, CASE s.airline_sentiment WHEN 'positive' THEN 1 WHEN 'neutral' THEN 0 WHEN 'negative' THEN -1 ELSE 0 END AS sentimentScore\n",
    "WITH l, collect(sentimentScore) AS sentimentScores\n",
    "RETURN l.hashtag AS location, apoc.coll.avg(sentimentScores) AS averageSentiment\n",
    "ORDER BY averageSentiment\n",
    "\"\"\"\n",
    "engine.execute_neo4j(sample_query)\n",
    "ed = time()\n",
    "print(f\"Runtime: {ed-st}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "47b270ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Runtime: 0.00099945068359375\n"
     ]
    }
   ],
   "source": [
    "# Sample of time reduction (same code)\n",
    "st = time()\n",
    "sample_query = \"\"\"\n",
    "MATCH (l:Hashtag)<-[:`Has_HT`]-(t:Tweet)\n",
    "WITH l, count(t) AS tweetCount\n",
    "WHERE tweetCount >= 10\n",
    "MATCH (l)<-[]-(:Tweet)-[:Has]->(s:Sentiment)\n",
    "WITH l, CASE s.airline_sentiment WHEN 'positive' THEN 1 WHEN 'neutral' THEN 0 WHEN 'negative' THEN -1 ELSE 0 END AS sentimentScore\n",
    "WITH l, collect(sentimentScore) AS sentimentScores\n",
    "RETURN l.hashtag AS location, apoc.coll.avg(sentimentScores) AS averageSentiment\n",
    "ORDER BY averageSentiment\n",
    "\"\"\"\n",
    "engine.execute_neo4j(sample_query)\n",
    "ed = time()\n",
    "print(f\"Runtime: {ed-st}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "de9aea5c",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Runtime: 0.3580482006072998\n"
     ]
    }
   ],
   "source": [
    "# Sample of MongoDB query\n",
    "st = time()\n",
    "query = {\n",
    "    \"State Name\": \"MA\",\n",
    "    \"Year\": 2018\n",
    "}\n",
    "projection = {\n",
    "    \"_id\": 0,\n",
    "    \"Airport Code\": 1,\n",
    "    \"City Name\": 1,\n",
    "    \"Average Fare ($)\": 1\n",
    "}\n",
    "engine.execute_mongo(\"airports\", query, projection)\n",
    "ed = time()\n",
    "print(f\"Runtime: {ed-st}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "14740306",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Runtime: 0.0010013580322265625\n"
     ]
    }
   ],
   "source": [
    "# Sample of time reduction (same code)\n",
    "st = time()\n",
    "query = {\n",
    "    \"State Name\": \"MA\",\n",
    "    \"Year\": 2018\n",
    "}\n",
    "projection = {\n",
    "    \"_id\": 0,\n",
    "    \"Airport Code\": 1,\n",
    "    \"City Name\": 1,\n",
    "    \"Average Fare ($)\": 1\n",
    "}\n",
    "engine.execute_mongo(\"airports\", query, projection)\n",
    "ed = time()\n",
    "print(f\"Runtime: {ed-st}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
